app/Controllers/BarangController.php

INSERT INTO `tb_barang` (`namabarang`, `jenis`, `harga`, `lokasi`) VALUES ('whiskas', 'makanan', '6000', 'naskndknas')
---
    public function create()
    {
        $model = new BarangModel();
        $data = [
          'namabarang' => request()->getPost('namabarang'),
          'jenis' => request()->getPost('jenis'),
          'harga' => request()->getPost('harga'),
          'lokasi' => request()->getPost('lokasi'),
          'detail' => request()->getPost('detail'),
        ];

        $id = (int) request()->getPost('id');
        if($id > 0){
            $r = $model->update($id, $data);
         }else{
             $r = $model->insert($data);

SELECT *
FROM `tb_barang`
---
     public function show(){
         $m = new BarangModel();

         return view('barang/tampildata', [
             'data_barang' => $m->findAll()
         ]);

DELETE FROM `tb_barang`
WHERE `id` IN ('8')
---
     public function delete(){
         $id = request()->getPost('id');
         $m = new BarangModel();
         $r = $m->delete($id);