app/Controllers/DokterController.php

    public function create()
    {
        $model = new DokterModel();
        $data = [
          'nama' => request()->getPost('nama'),
          'notlp' => request()->getPost('notlp'),
          'jadwal' => request()->getPost('jadwal'),
          'lokasi' => request()->getPost('lokasi'),
        ];

        $id = (int) request()->getPost('id');
        if($id > 0){
            $r = $model->update($id, $data);
         }else{
             $r = $model->insert($data);
---
INSERT INTO `tb_dokter` (`nama`, `notlp`, `jadwal`, `lokasi`) VALUES ('DHOFA RIZKI ALFARID', '164654', '16.00', 'JL. Suwignyo')

     public function show(){
         $m = new DokterModel();

         return view('dokter/tampildata', [
             'data_dokter' => $m->findAll()
         ]);
---
SELECT *
FROM `tb_dokter`

     public function delete(){
         $id = request()->getPost('id');
         $m = new DokterModel();
         $r = $m->delete($id);
---
DELETE FROM `tb_dokter`
WHERE `id` IN ('1')