app/Controllers/PenggunaController.php

     public function show(){
         $m = new PenggunaModel();

         return view('pengguna/tampildata', [
             'data_pengguna' => $m->findAll()
         ]);
---
SELECT *
FROM `tb_pengguna`